In [10]:
import pandas as pd
df = pd.read_csv('data/exam_sample.csv')
df

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m
4           5     B       65       80    90   w
5           6     B       98       89    50   m
6           7     B       45       90    80   m
7           8     B       25       78    90   w
8           9     C       15       98    20   w
9          10     C       45       93    50   w

In [11]:
df_class = df.groupby(['class'])
df_class

In [12]:
df_class.get_group('A')

   student_no class  science  english  math sex
0           1     A       50       98    50   m
1           2     A       60       97    60   w
2           3     A       78       86    45   w
3           4     A       58       98    30   m

In [17]:
df_class.mean(numeric_only=True)

       student_no  science  english   math
class
A             2.5    61.50    94.75  46.25
B             6.5    58.25    84.25  77.50
C             9.5    30.00    95.50  35.00

In [19]:
df.groupby(['class', 'sex']).mean()

           student_no  science  english  math
class sex
A     m           2.5     54.0     98.0  40.0
      w           2.5     69.0     91.5  52.5
B     m           6.5     71.5     89.5  65.0
      w           6.5     45.0     79.0  90.0
C     w           9.5     30.0     95.5  35.0

In [24]:
df_class[['math']].mean(numeric_only=True)

        math
class
A      46.25
B      77.50
C      35.00

* agg : 집계 연산

In [25]:
import numpy as np
df_class.agg({'math':np.max, 'english':np.min})

C:\Users\user\AppData\Local\Temp\ipykernel_9900\2021939661.py:2: FutureWarning: The provided callable <function max at 0x000001EA95087BA0> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'max' instead.
  df_class.agg({'math':np.max, 'english':np.min})
C:\Users\user\AppData\Local\Temp\ipykernel_9900\2021939661.py:2: FutureWarning: The provided callable <function min at 0x000001EA95087CE0> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'min' instead.
  df_class.agg({'math':np.max, 'english':np.min})

       math  english
class
A        60       86
B        90       78
C        50       93

In [26]:
import numpy as np
df_class.agg({'math':np.mean, 'english':np.sum})

C:\Users\user\AppData\Local\Temp\ipykernel_9900\3343510728.py:2: FutureWarning: The provided callable <function mean at 0x000001EA950945E0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'mean' instead.
  df_class.agg({'math':np.mean, 'english':np.sum})
C:\Users\user\AppData\Local\Temp\ipykernel_9900\3343510728.py:2: FutureWarning: The provided callable <function sum at 0x000001EA950874C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'sum' instead.
  df_class.agg({'math':np.mean, 'english':np.sum})

        math  english
class
A      46.25      379
B      77.50      337
C      35.00      191

In [27]:
import numpy as np
df_class.agg({'math':[np.mean, np.sum], 'english':np.sum})

C:\Users\user\AppData\Local\Temp\ipykernel_9900\2170444316.py:2: FutureWarning: The provided callable <function mean at 0x000001EA950945E0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'mean' instead.
  df_class.agg({'math':[np.mean, np.sum], 'english':np.sum})
C:\Users\user\AppData\Local\Temp\ipykernel_9900\2170444316.py:2: FutureWarning: The provided callable <function sum at 0x000001EA950874C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass 'sum' instead.
  df_class.agg({'math':[np.mean, np.sum], 'english':np.sum})

        math      english
        mean  sum     sum
class
A      46.25  185     379
B      77.50  310     337
C      35.00   70     191